---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.Custom
source: html/064fe74c-d638-7930-65fd-508f906e3044.htm
---
# Autodesk.Revit.DB.UnitTypeId.Custom Property

Unrecognized custom unit.

## Syntax (C#)
```csharp
public static ForgeTypeId Custom { get; }
```